[{"Type":"Technical Risks", "ID":"TECH-01", "Title":"Resource exhaustion", "Description":"Not enough capacity available to meet increase in customer demand. In situations where clients are excessively adding resources, the risk of resource exhaustion might occur.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-02", "Title":"Spam overloading customer environments or causing problems with external services.", "Description":"Outgoing or incoming spam causing performance bottlenecks in customer environments. Spam makes up 90% of all e-mail traffic. Detecting spam is a resource-intensive process. On heavy-load environments, the amount of spam may bring down the provided services.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-03", "Title":"Procedures restricting the service", "Description":"Procedures and policies get in the way of service provision or problem resolution. If an organization does not have the flexibility to deal with unforeseen circumstances the services could be threatened if those circumstances occur.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-04", "Title":"Unsafe working environment.", "Description":"Unsafe working environment resulting in technical or financial issues or prohibit adequate problem solution. When performing activities outside of the office workplace, the same risks apply.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-05", "Title":"Over-dependance on certain members of the personnel", "Description":"The loss of critical personnel may lead to a loss of control over the IT infrastructure or a reduction in incident response capability.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-06", "Title":"Errors in communication with third parties.", "Description":"When a service provider works with suppliers, there is a risk service agreements or procedures are incorrectly defined. This risk also covers working with suppliers and consultants working on the service organisation's premises.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-07", "Title":"Loss of synchronised time keeping.", "Description":"Timestamps of system and audit logs are essential to adequate handling of incidents. Loss of synchronised time keeping will lead to errors in analysis of issues and incidents.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-08", "Title":"Provider loss of service due to termination or failure.", "Description":"This risk covers all situations where a technical failure occurs at a supplier, a supplier terminates its service intentionally or because of a change in business circumstances.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-09", "Title":"Distributed Denial of Service", "Description":"A distributed denial of service attack on one or more IP addresses within the network threatens the service.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-10", "Title":"Loss (not compromise) of operational logs", "Description":"The loss of operational logs makes it difficult to evaluate operational variables. The options when solving issues are limited when no data is available for analysis. Loss of operational logs may occur in case of under-provisioning of storage.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-11", "Title":"Loss (not compromise) of security logs", "Description":"The loss of security logs poses a risk for managing the implementation of the information security management program. Loss of security logs may occur in case of under-provisioning of storage.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-12", "Title":"Loss of backups", "Description":"A lack of data-restore options, when backup data is lost or damaged, can put the provided service levels at risk.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-13", "Title":"Natural disasters", "Description":"Natural disasters threaten cloud provider infrastructure. This risk must include possible increased risk probability related to the location of the cloud provider's infrastructure.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-14", "Title":"Data Center Outage", "Description":"Datacenter power or cooling failure or other calamity leads to failure in provided services.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-15", "Title":"Data Storage Failure", "Description":"Data can be lost or access to the storage network can be prohibited. Also, when meta-information of data is lost, similar problems may occur.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-16", "Title":"External Network Outage", "Description":"The cloud provider might lose it's external network connections. External connectivity is a crucial part of the provided services.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-17", "Title":"Server Failure", "Description":"Failure of server nodes hosting the actual customer environments.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-18", "Title":"Cloud Provider Network Failure", "Description":"Failure of the internal cloud provider's switching and routing network may threaten connectivity for customer environments.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-20", "Title":"Management interface failure", "Description":"Most cloud providers provide their a management interface for clients through which they can operate their services. Errors in Management Interface software disrupt service or data integrity.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-21", "Title":"Management Systems Failure", "Description":"The cloud provider management systems controls the infrastructure and allocates resources. Errors in these systems can disrupt service or data integrity", "Score":1},{"Type":"Technical Risks", "ID":"TECH-22", "Title":"Loss of data because of loss of data ownership", "Description":"The meta-information of stored data is essential in linking data to its owner. When metadata is lost, the data itself could be lost as well.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-23", "Title":"Human Error resulting in failure", "Description":"Cloud provider's personnel can introduce technical failure due to lack of experience, knowledge of responsibility.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-24", "Title":"Loss of equipment governance", "Description":"Inadequate management of equipment may lead to loss of control of equipment. Hardware may go missing, can be purchased twice, handed over to the wrong parties or provisioned incorrectly.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-25", "Title":"Maintenance causing disruptions", "Description":"Maintenance performed by the service provider can cause unplanned outages, disrupting the provided service.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-26", "Title":"Inadequate technical risk planning", "Description":"The risks recognized in the risk analysis process are not properly translated into the risk management program. Adequate risk management includes planning of the risk management program activities.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-27", "Title":"Inadequate implementation of risk mitigation measures", "Description":"Mitigation measures derived from the risk management program are not properly implemented.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-28", "Title":"Introduction of new components leads to technical failure", "Description":"The introduction of new system components may lead to technical risks impacting the quality and continuity of provided services.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-29", "Title":"Lack of maintenance or replacement of IT infrastructure components.", "Description":"Existing components are not maintained properly and not replaced in time, leading to technical failure.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-30", "Title":"License risks", "Description":"Mismanagement of software licenses leads to legal risks or threatens the service.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-31", "Title":"Loss of customer account or management system configuration data.", "Description":"Customer account and configuration data is essential in the service provisioning process. Loss of customer account and configuration data can lead to loss of service.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-32", "Title":"Provider office systems unavailable.", "Description":"Provider can not manage the service because its office systems are not available for its employees.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-33", "Title":"Changes to third party services causes failures in provider system.", "Description":"Planned and unplanned changes performed by suppliers on their supplied services may causes failures in the provider system.", "Score":1},{"Type":"Technical Risks", "ID":"TECH-34", "Title":"Data migration, backup recovery or other provider activity leading to data loss.", "Description":"Data migration or backup recovery by cloud provider leading to data loss.", "Score":1.1},{"Type":"Technical Risks", "ID":"TECH-35", "Title":"Inadequate technical risk analysis", "Description":"Risk analysis is not thorough enough and essential technical risks are overlooked in the risk analysis phase.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-01", "Title":"Customer management interface compromise", "Description":"The management interface is exposed to the public internet to provide broad access for customers. Vulnerabilities in the management interface could lead to unauthorised access and compromise of underlying systems.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-02", "Title":"Insecure or ineffective deletion of data", "Description":"Insecure or ineffective deletion of data leads to exposure of data to unauthorised parties. Common examples include disposal of storage devices and removable media and deletion of data after deprovisioning of customer services.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-03", "Title":"Incomplete deprovisioning of access", "Description":"Incomplete deprovisioning of access leads  to unauthorised access. Attempts to access deprovisioned services may indicate malicious intent.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-04", "Title":"Loss of equipment ownership leading to security risks.", "Description":"Poor equipment management leads to loss of hardware governance and unauthorised access.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-05", "Title":"Loss of data ownership within network", "Description":"Third parties can get access to customer data due to a loss of ownership. Data might be assigned incorrectly to other clients or get transferred to testing-environments", "Score":1},{"Type":"Security Risks", "ID":"SECUR-06", "Title":"Loss of control over paper based information or information media leading to security risks.", "Description":"Paper records and media must be kept safe. Loss of control over paper records or media can lead to security risks.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-07", "Title":"Compromised backup system", "Description":"Vulnerabilities in backup system can lead to unauthorised access and data leakage. Since backups essentially exist of a representation of a production system, sensitive data will be present in backups.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-08", "Title":"Compromised hardware (not physical)", "Description":"Unauthorised access is gained to the software that directly controls the hardware components. Routers, switches and other network components must be included in evaluating this risk.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-10", "Title":"Data leakage on up/download, inter-cloud", "Description":"Data could be intercepted when traversing the public internet.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-11", "Title":"Loss of encryption keys", "Description":"The loss of encryption keys required for secure communication or systems access provide a potential attacker with the possibility to get unauthorised assets.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-12", "Title":"Undertaking malicious probes or scans", "Description":"Network scans from outside or inside provides attackers knowledge of the network structure and system flaws. Scans are always performed with malicious intent and successful scans provide additional risks.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-13", "Title":"Compromised provider cloud management systems (including logging system)", "Description":"Vulnerability in cloud provider management systems leads to unauthorized access.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-17", "Title":"Privilege escalation", "Description":"A mistake in the access allocation system causes a customer, third party or employee to get more access rights than needed.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-18", "Title":"Human error leading to vulnerability", "Description":"Human oversight in performing those activities may lead to unauthorised access or system vulnerabilities due to misconfiguration..", "Score":1},{"Type":"Security Risks", "ID":"SECUR-19", "Title":"Social engineering attacks", "Description":"Providing misinformation or other forms of manipulation lead to unauthorised access.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-20", "Title":"Provider workplace systems are compromised electronically.", "Description":"Cloud provider's workstations could provide access to cloud infrastructure, making it a likely target for outside attacks.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-21", "Title":"Wireless device or wireless network breach", "Description":"Wireless networks provide access to workplace environments. Drive-by attacks on the wireless network targeted at obtaining unauthorised access to the IT infrastructure can occur. Wireless networks also provide a direct method to attack a workplace environment without physical access to the premises.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-22", "Title":"Unauthorized access to premises/physical hardware", "Description":"Unauthorised physical access leads to compromise of systems or customer privacy. Attackers might gain access to premises to tamper with equipment.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-23", "Title":"Theft of computer equipment", "Description":"Hardware theft from company or employees leads to compromise of systems or customer privacy. Stolen equipment can be used to try to gain access to cloud provider's infrastructure.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-24", "Title":"Malicious insider", "Description":"One or more malicious insiders abuse their access rights to compromise the system.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-25", "Title":"Lack of planning and strategic adaptability leads to security oversight", "Description":"Known security risks are not dealt with due to a lack of planning and commitment.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-26", "Title":"Inadequate response to security breach.", "Description":"Inadequate response to a security incident leading to increased damage or vulnerabilities. Evidence of the attack could be destroyed when handling the security breach.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-27", "Title":"Organisation does not learn from security incidents.", "Description":"Organization finds it difficult to adapt procedures and its IT configuration after a security incident exposes weaknesses to them.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-28", "Title":"Compromised logs prohibit effective response.", "Description":"Compromised or deleted logs prohibit effective response to security breach as analysis of the incident can not properly be performed. Logs might be faked by an attacker misleading the security analysis.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-30", "Title":"Third party personnel inadvertently causing a security breach.", "Description":"Third party personnel are causing vulnerabilities by not following procedures, following incorrect procedures or being misinformed.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-31", "Title":"Third party personnel purposefully causing a security breach.", "Description":"Provider personnel causing a vulnerability or unauthorised access situation on purpose.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-32", "Title":"New components introduce a security risk", "Description":"The introduction of new system components may lead to vulnerabilities in the information system.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-33", "Title":"Security breach is not spotted", "Description":"A security incident is not recognized (false negative) or mistakenly regarded as a true negative.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-34", "Title":"Accessibility of ports, unnecessary software or weak protocols making breach of the IT infrastructure possible.", "Description":"Running unnecessary services on publicly accessible systems provide an attack vector to malicious outsiders.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-35", "Title":"Compromise of publicly available information systems.", "Description":"Publicly available information systems like wiki's or forums are compromised. Leading to reputation damage and security risks.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-36", "Title":"Security plans are not properly implemented.", "Description":"Faulty implementation of security policies results in vulnerabilities.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-37", "Title":"Security incident recognition system reports too many false positives.", "Description":"Too many false positives from the incident recognition management system result in a decreased responsiveness to incidents.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-38", "Title":"Important security events in outside world are not spotted.", "Description":"Outside security developments or threats are missed by the organisation..", "Score":1},{"Type":"Security Risks", "ID":"SECUR-39", "Title":"Security vulnerability in provider systems.", "Description":"Security vulnerability in the provider information systems leading to compromise..", "Score":1},{"Type":"Security Risks", "ID":"SECUR-40", "Title":"Interfacing with third parties is compromised.", "Description":"The interfacing from the provider information system with third parties is compromised.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-41", "Title":"Off site media and equipment posing a security risk.", "Description":"Equipment or media that is taken off-site are at risk of compromise.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-42", "Title":"Poor network design and configuration leading to security vulnerabilities.", "Description":"Network design and configuration are leaving attack vectors open.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-43", "Title":"Poor information system design and configuration leading to security vulnerabilities.", "Description":"Lack of design and architecture of information systems will lead to security issues due to a lack of overview of security  implications when developing the information system.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-44", "Title":"Privileged provider information becoming public knowledge without the provider noticing.", "Description":"Confidential information regarding configuration, passwords or procedures is leaked to outsiders without the provider noticing.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-45", "Title":"Breach of one system leads to breach of multiple systems.", "Description":"Once access is gained to part of the information system is gained, access to other nodes in the infrastructure is usually easy.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-46", "Title":"Incomplete security risk analysis.", "Description":"Risk analysis is performed properly and essential security risks are overlooked in the risk analysis phase.", "Score":1},{"Type":"Security Risks", "ID":"SECUR-47", "Title":"Provider password storage is compromised.", "Description":"Provider password storage is compromised leading to unauthorised access.", "Score":1.1},{"Type":"Security Risks", "ID":"SECUR-48", "Title":"Connection between employees working externally and the network is compromised.", "Description":"Connection between employees working externally and the network is compromised leading to unauthorised access.", "Score":1.1},{"Type":"Security Risks", "ID":"SECUR-49", "Title":"Privilege breach", "Description":"An unauthorised person gains access to the IT infrastructure on purpose.", "Score":1.1},{"Type":"Legal Risks", "ID":"LEGAL-01", "Title":"Subpoena and e-discovery", "Description":"Customer data and services are subpoenaed or subjected to a cease and desist request from authorities or third parties.", "Score":1},{"Type":"Legal Risks", "ID":"LEGAL-02", "Title":"Risk from changes in jurisdiction", "Description":"Change in jurisdiction of the data leads to the risk the data or information system is blocked or impounded by a government or other organisation.", "Score":1},{"Type":"Legal Risks", "ID":"LEGAL-03", "Title":"Data protection risks", "Description":"Cloud provider failure to comply with data protection laws and SLA-agreements can lead to breaches of law and regulations.", "Score":1},{"Type":"Legal Risks", "ID":"LEGAL-04", "Title":"Change of law, jurisprudence or regulation.", "Description":"Change of law, jurisprudence or regulation resulting in extra costs or risks for both the client and the service organisation.", "Score":1},{"Type":"Legal Risks", "ID":"LEGAL-05", "Title":"Change in government policy towards basic rights or corruption", "Description":"Change in government policy towards property right, privacy or a government corruption threatens the service the provider can deliver.", "Score":1},{"Type":"Legal Risks", "ID":"LEGAL-06", "Title":"Data disposal policy or practice resulting in breach of law.", "Description":"Data disposal policy or practice of the cloud provider resulting in breach of law.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-01", "Title":"Supplier Lock-in", "Description":"Technical and contractual difficulties prohibit customer to move to another cloud provider. This results in a poor negotiating position and risks if the service is compromised in any way.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-02", "Title":"Mismatch between SLA and delivery.", "Description":"Cloud provider internal miscommunication causes mismatch between SLA and delivery.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-03", "Title":"Conflicts between customer hardening procedures and cloud environment", "Description":"Unclarity about cloud provider hardening procedures leads to blind spots or limitations in the customer infrastructure.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-04", "Title":"Licensing risks (related to ownership of customer data and software)", "Description":"The customer should always retain ownership over its software assets located within the cloud provider environment.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-05", "Title":"Cloud provider suspends service.", "Description":"A customer service is suspended or throttled by cloud provider.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-06", "Title":"Unavailability of operational information.", "Description":"The customer does not receive the proper operational information regarding their IT infrastructure.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-07", "Title":"Unavailability of data on SLA achievement", "Description":"Data on SLA achievement is not available causing the customer not being able to verify the delivered results.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-08", "Title":"Compliance challenges", "Description":"Lack of information makes it difficult to assess compliance with law, certification and standards.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-09", "Title":"Cloud provider termination.", "Description":"The cloud provider has to terminate the service because of financial or legal reasons.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-10", "Title":"The involvement of multiple parties leads to confused access rights.", "Description":"The involvement of multiple parties lead to a loss of control due to mismanaged access rights.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-11", "Title":"Cloud provider is restricted by procedures.", "Description":"Cloud provider lacks the flexibility in its procedures to deal with security and performance problems.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-12", "Title":"Financial transactions are compromised", "Description":"Financial transactions between customer and cloud provider are compromised causing financial damage or disruption of service.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-13", "Title":"Customer account data is lost because of storage failure", "Description":"Provider storage failure leads to destruction of important customer account data.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-14", "Title":"Economical Denial of Service", "Description":"Malicious customer employee abuses access rights to procure significant capacity or deprovision services.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-15", "Title":"Cloud provider technology and SLA terms divert from industry standards.", "Description":"Cloud provider technology, standards and SLA terms do not follow industry standards.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-16", "Title":"Customer SLA unclarity.", "Description":"The definitions in the customer SLA are not clear enough leading to disputes regarding SLA performance.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-17", "Title":"Cloud provider breaches quality standard.", "Description":"Provider does not follow its internal procedures, quality standards and guidelines.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-18", "Title":"SLA Changes", "Description":"Provider initiated changes to the SLA alters the quality of service.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-19", "Title":"Customer SLA Breach by provider.", "Description":"Terms of the customer SLA are breached by the provider.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-20", "Title":"Business Model change", "Description":"A change in cloud provider strategy prompts a deterioration of the service.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-21", "Title":"Cloud provider terminates contract", "Description":"The cloud provider terminates customer services with or without notice leading to a loss of service.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-22", "Title":"Cloud provider dealing with customer legal situations.", "Description":"The cloud provider will be dealing with legal situations like subpoenas and cease and desist requests on behalf of the customer.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-23", "Title":"Cloud provider holding customer (account) data (privacy issue)", "Description":"Cloud provider neglecting its responsibilities with respect to customer privacy.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-24", "Title":"Reputation cloud provider and its suppliers", "Description":"A loss of reputation of the cloud provider or its suppliers lead to a loss of business reputation for the customer.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-25", "Title":"Cloud provider breach of law", "Description":"A breach of law by the cloud provider leading to a loss of customer reputation or a service interruption.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-26", "Title":"Data jurisdiction is not controlled by customer.", "Description":"Uncontrolled change in jurisdiction of customer data leads to the risk the data is blocked or impounded by a government or other organisation.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-27", "Title":"Access to support is restricted.", "Description":"The customer can not access the required level of support from the provider. The service support organisation is restricted by unreasonable timeframes or does not provide required support on request.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-28", "Title":"Lack of information on outages and maintenance.", "Description":"Lack of information on outages and maintenance making client infrastructure management more difficult.", "Score":1},{"Type":"Outsourcing risks", "ID":"OUTSRC-29", "Title":"Cloud provider supplier SLA does not match customer SLA", "Description":"Cloud provider supplier SLA does not match customer SLA resulting in customer SLA being breached.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-30", "Title":"Extreme provisioning paterns because of faulty customer side software.", "Description":"Extreme provisioning paterns because of faulty customer side software resulting in a loss of cost control.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-31", "Title":"Lack of information regarding resource usage.", "Description":"Lack of information regarding resource usage leading to a loss of cost control.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-32", "Title":"Unclearity about used resources.", "Description":"The used and billed resources are difficult to evaluate for the customer.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-33", "Title":"Dishonest or faulty resource reporting.", "Description":"Dishonest or faulty resource reporting by cloud provider leading to overreporting of used resources.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-34", "Title":"Cloud provider failure to pay supplier.", "Description":"Cloud provider failure to pay supplier leads to service interuption or data loss.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-35", "Title":"Access rights of customer employees are difficult to change.", "Description":"Access rights of customer employees in the customer interface are difficult to manage.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-36", "Title":"Customer interface accounts used by multiple people making accountability and authorisation difficult.", "Description":"Multiple customer employees using the customer interface makes individual accountability and authorisation difficult.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-37", "Title":"Customer failure to pay cloud provider.", "Description":"Customer failure to pay cloud provider leading to service interuption or data loss.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-38", "Title":"Unavailability of information on standard compliance.", "Description":"Customers do not have enough information to evaluate compliance with the quality standards the provider is committed to.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-39", "Title":"Customer loss of control regarding maintenance windows.", "Description":"Customer loss of control regarding maintenance windows leading to inconvenient downtime.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-40", "Title":"Lack of control about technological changes.", "Description":"Lack of control about technological changes could lead to integration issues.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-41", "Title":"Data retention policies do not match laws.", "Description":"Data retention policies results in a breach of law.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-42", "Title":"Encryption technologies are not disclosed resulting in customer breach of law.", "Description":"Encryption technologies and policies are not disclosed resulting in customer breach of law.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-43", "Title":"Privacy breach by cloud provider personel.", "Description":"Cloud provider personel gains access to confidential data on the customer environment resulting in a breach of the customers' privacy obligations.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-44", "Title":"Malicious cloud provider employee.", "Description":"Malicious cloud provider employee gaining unauthorised access or using authorised access to malicious intent.", "Score":1.1},{"Type":"Outsourcing risks", "ID":"OUTSRC-45", "Title":"Unavailability of management information.", "Description":"The customer does not have the proper management information regarding their IT infrastructure.", "Score":1},{"Type":"Co-tenancy Risks", "ID":"TENAN-01", "Title":"Co-tenant activities result in technical restrictions", "Description":"Co-tenant activities that pose an inconvenience or are a threat to third parties can result in technical restrictions for the customer.", "Score":1},{"Type":"Co-tenancy Risks", "ID":"TENAN-02", "Title":"Loss of business reputation due to co-tenant activities", "Description":"Activities from co-tenants damage customer reputation. Shared co-tenancy aspects like IP-networks might implicate a relationship between tenant activities.", "Score":1},{"Type":"Co-tenancy Risks", "ID":"TENAN-03", "Title":"Isolation failure (network level)", "Description":"A co-tenant purposely or accidentally gains access to the resources of another customer by intercepting network traffic.", "Score":1},{"Type":"Co-tenancy Risks", "ID":"TENAN-04", "Title":"Subpoena of co-tenant leads to critical hardware being impounded.", "Description":"A subpoena request targeting another customer impounds hardware critical to the customers' services.", "Score":1},{"Type":"Co-tenancy Risks", "ID":"TENAN-05", "Title":"Over-usage of shared resources by certain clients.", "Description":"Over-usage of shared resources by one or more other customers threaten services of other customers.", "Score":1},{"Type":"Co-tenancy Risks", "ID":"TENAN-09", "Title":"Intercepting or modifying data in transit (within cloud/network)", "Description":"Customer or provider data traversing the cloud is intercepted by another customer or third party. Virtualized environments or the network infrastructure might have vulnerabilities which allow snooping or even modification of data.", "Score":1},{"Type":"Co-tenancy Risks", "ID":"TENAN-10", "Title":"Multiple customers simultaniously peak processing.", "Description":"Multiple customers simultaniously peak processing leading to resource exhaustion.", "Score":1.1},{"Type":"Co-tenancy Risks", "ID":"TENAN-11", "Title":"Cloud provider is attacked because it is a large target.", "Description":"Cloud provider might make for a more attractive target for attacks because it hosts a large number of customers.", "Score":1.1},{"Type":"Co-tenancy Risks", "ID":"TENAN-14", "Title":"Compromised Hypervisor (separation of customers)", "Description":"Vulnerability in hypervisor leads to unauthorized access from one virtual machine to another.", "Score":1},{"Type":"Co-tenancy Risks", "ID":"TENAN-15", "Title":"Isolation failure in the storage.", "Description":"Vulnerability in the storage layer leads to unauthorised access. If data partitions are not isolated properly, customers can access  co-tenant data.", "Score":1},{"Type":"Virtualisation Risk", "ID":"XLS-VIRT01", "Title":"Attacks on the virtual infrastructure from the outside of the network.", "Description":"Attacks on the virtual infrastructure from the outside of the network leading to unauthorised access.", "Score":1.1},{"Type":"Virtualisation Risk", "ID":"XLS-VIRT02", "Title":"Lacking policies relating to dormant virtual machines and snapshots.", "Description":"Insufficient oversight relating to dormant virtual machines and snapshots resulting in security risks.", "Score":1.1},{"Type":"Virtualisation Risk", "ID":"XLS-VIRT03", "Title":"Hypervisor Failure", "Description":"Errors in hypervisor software disrupt service or data integrity. Virtualization and multi-tenancy are the basis of cloud computing but can also introduce risks.", "Score":1}]